app/controllers/books_controller.rb

INSERT INTO "books" ("created_at", "updated_at", "title", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2020-05-11 09:04:41.524756"], ["updated_at", "2020-05-11 09:04:41.524756"], ["title", "d"], ["body", "wed"], ["user_id", 1]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save