app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "postcode" = ?, "address_city" = ?, "address_street" = ?, "address_building" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["postcode", 1110035], ["address_city", "台東区"], ["address_street", "西浅草"], ["address_building", ""], ["updated_at", "2020-05-11 09:05:13.806059"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)